<a href="https://colab.research.google.com/github/ssanchezgoe/curso_deep_learning_economia/blob/main/NBs_Google_Colab/DL_S02_Pandas_Data_Wrangling.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

<p><img alt="Colaboratory logo" height="140px" src="https://upload.wikimedia.org/wikipedia/commons/archive/f/fb/20161010213812%21Escudo-UdeA.svg" align="left" hspace="10px" vspace="0px"></p>

<h1> Curso Deep Learning: Economía</h1>

## S02: Preprocesado de datos

## Tabla de contenido

Temática:

- Exploración de datos.
- Pandas

## Exploración de datos

La fase de exploración de datos consiste en una serie de pasos con el fin de preparar los datos para su correcto funcionamiento dentro de algoritmos de machine learning/deep learning. Alguno de los pasos que deben verificarse son:

- Tamaño del dataset.
- Número de características.
- Datos faltantes.
- Tipos de datos.
- Correlaciones y distribuciones. 

Además, esta serie de pasos facilitan al científico de datos a encontrar relaciones de las características con la variable objetivo a predecir. En este sentido, se pueden llevar a cabo dos tipos de análisis sobre los datos:


- Analisis cualitativos, en donde se estiman relaciones de tendencias centrales de las característiscas y la variable objetivo.
- Analisis cuantitativos, en donde se realizan mediciones que corroborarn las relaciones entre las características y la variable objetivo.

Para esta tarea, en python se hace uso de la librería **Pandas**.

## PANDAS:

Pandas es una librería en python que se basa en **Numpy**, usada en computación y ciencia de datos con el fin de manipular y analizar datos.

El objeto central de pandas corresponde a los `DataFrames`que son elementos tabulares con métodos y atributos destinados a tareas de análisis exploratorio de datos.

Para cargar la librería de `pandas` en el entorno de ejecución, se ha vuelto constumbre asignarle el alias `pd` de la siguiente forma 

```
import pandas as pd
```

Algunos de los formatos permitidos por pandas se resumen en la siguiente tabla:

<table class="colwidths-given table">
<colgroup>
<col style="width: 12%">
<col style="width: 40%">
<col style="width: 24%">
<col style="width: 24%">
</colgroup>
<thead>
<tr class="row-odd"><th class="head"><p>Format Type</p></th>
<th class="head"><p>Data Description</p></th>
<th class="head"><p>Reader</p></th>
<th class="head"><p>Writer</p></th>
</tr>
</thead>
<tbody>
<tr class="row-even"><td><p>text</p></td>
<td><p><a class="reference external" href="https://en.wikipedia.org/wiki/Comma-separated_values">CSV</a></p></td>
<td><p><a class="reference internal" href="#io-read-csv-table"><span class="std std-ref">read_csv</span></a></p></td>
<td><p><a class="reference internal" href="#io-store-in-csv"><span class="std std-ref">to_csv</span></a></p></td>
</tr>
<tr class="row-odd"><td><p>text</p></td>
<td><p>Fixed-Width Text File</p></td>
<td><p><a class="reference internal" href="#io-fwf-reader"><span class="std std-ref">read_fwf</span></a></p></td>
<td></td>
</tr>
<tr class="row-even"><td><p>text</p></td>
<td><p><a class="reference external" href="https://www.json.org/">JSON</a></p></td>
<td><p><a class="reference internal" href="#io-json-reader"><span class="std std-ref">read_json</span></a></p></td>
<td><p><a class="reference internal" href="#io-json-writer"><span class="std std-ref">to_json</span></a></p></td>
</tr>
<tr class="row-odd"><td><p>text</p></td>
<td><p><a class="reference external" href="https://en.wikipedia.org/wiki/HTML">HTML</a></p></td>
<td><p><a class="reference internal" href="#io-read-html"><span class="std std-ref">read_html</span></a></p></td>
<td><p><a class="reference internal" href="#io-html"><span class="std std-ref">to_html</span></a></p></td>
</tr>
<tr class="row-even"><td><p>text</p></td>
<td><p><a class="reference external" href="https://en.wikipedia.org/wiki/LaTeX">LaTeX</a></p></td>
<td></td>
<td><p><a class="reference internal" href="#io-latex"><span class="std std-ref">Styler.to_latex</span></a></p></td>
</tr>
<tr class="row-odd"><td><p>text</p></td>
<td><p><a class="reference external" href="https://www.w3.org/standards/xml/core">XML</a></p></td>
<td><p><a class="reference internal" href="#io-read-xml"><span class="std std-ref">read_xml</span></a></p></td>
<td><p><a class="reference internal" href="#io-xml"><span class="std std-ref">to_xml</span></a></p></td>
</tr>
<tr class="row-even"><td><p>text</p></td>
<td><p>Local clipboard</p></td>
<td><p><a class="reference internal" href="#io-clipboard"><span class="std std-ref">read_clipboard</span></a></p></td>
<td><p><a class="reference internal" href="#io-clipboard"><span class="std std-ref">to_clipboard</span></a></p></td>
</tr>
<tr class="row-odd"><td><p>binary</p></td>
<td><p><a class="reference external" href="https://en.wikipedia.org/wiki/Microsoft_Excel">MS Excel</a></p></td>
<td><p><a class="reference internal" href="#io-excel-reader"><span class="std std-ref">read_excel</span></a></p></td>
<td><p><a class="reference internal" href="#io-excel-writer"><span class="std std-ref">to_excel</span></a></p></td>
</tr>
<tr class="row-even"><td><p>binary</p></td>
<td><p><a class="reference external" href="http://www.opendocumentformat.org">OpenDocument</a></p></td>
<td><p><a class="reference internal" href="#io-ods"><span class="std std-ref">read_excel</span></a></p></td>
<td></td>
</tr>
<tr class="row-odd"><td><p>binary</p></td>
<td><p><a class="reference external" href="https://support.hdfgroup.org/HDF5/whatishdf5.html">HDF5 Format</a></p></td>
<td><p><a class="reference internal" href="#io-hdf5"><span class="std std-ref">read_hdf</span></a></p></td>
<td><p><a class="reference internal" href="#io-hdf5"><span class="std std-ref">to_hdf</span></a></p></td>
</tr>
<tr class="row-even"><td><p>binary</p></td>
<td><p><a class="reference external" href="https://github.com/wesm/feather">Feather Format</a></p></td>
<td><p><a class="reference internal" href="#io-feather"><span class="std std-ref">read_feather</span></a></p></td>
<td><p><a class="reference internal" href="#io-feather"><span class="std std-ref">to_feather</span></a></p></td>
</tr>
<tr class="row-odd"><td><p>binary</p></td>
<td><p><a class="reference external" href="https://parquet.apache.org/">Parquet Format</a></p></td>
<td><p><a class="reference internal" href="#io-parquet"><span class="std std-ref">read_parquet</span></a></p></td>
<td><p><a class="reference internal" href="#io-parquet"><span class="std std-ref">to_parquet</span></a></p></td>
</tr>
<tr class="row-even"><td><p>binary</p></td>
<td><p><a class="reference external" href="https://orc.apache.org/">ORC Format</a></p></td>
<td><p><a class="reference internal" href="#io-orc"><span class="std std-ref">read_orc</span></a></p></td>
<td></td>
</tr>
<tr class="row-odd"><td><p>binary</p></td>
<td><p><a class="reference external" href="https://en.wikipedia.org/wiki/Stata">Stata</a></p></td>
<td><p><a class="reference internal" href="#io-stata-reader"><span class="std std-ref">read_stata</span></a></p></td>
<td><p><a class="reference internal" href="#io-stata-writer"><span class="std std-ref">to_stata</span></a></p></td>
</tr>
<tr class="row-even"><td><p>binary</p></td>
<td><p><a class="reference external" href="https://en.wikipedia.org/wiki/SAS_(software)">SAS</a></p></td>
<td><p><a class="reference internal" href="#io-sas-reader"><span class="std std-ref">read_sas</span></a></p></td>
<td></td>
</tr>
<tr class="row-odd"><td><p>binary</p></td>
<td><p><a class="reference external" href="https://en.wikipedia.org/wiki/SPSS">SPSS</a></p></td>
<td><p><a class="reference internal" href="#io-spss-reader"><span class="std std-ref">read_spss</span></a></p></td>
<td></td>
</tr>
<tr class="row-even"><td><p>binary</p></td>
<td><p><a class="reference external" href="https://docs.python.org/3/library/pickle.html">Python Pickle Format</a></p></td>
<td><p><a class="reference internal" href="#io-pickle"><span class="std std-ref">read_pickle</span></a></p></td>
<td><p><a class="reference internal" href="#io-pickle"><span class="std std-ref">to_pickle</span></a></p></td>
</tr>
<tr class="row-odd"><td><p>SQL</p></td>
<td><p><a class="reference external" href="https://en.wikipedia.org/wiki/SQL">SQL</a></p></td>
<td><p><a class="reference internal" href="#io-sql"><span class="std std-ref">read_sql</span></a></p></td>
<td><p><a class="reference internal" href="#io-sql"><span class="std std-ref">to_sql</span></a></p></td>
</tr>
<tr class="row-even"><td><p>SQL</p></td>
<td><p><a class="reference external" href="https://en.wikipedia.org/wiki/BigQuery">Google BigQuery</a></p></td>
<td><p><a class="reference internal" href="#io-bigquery"><span class="std std-ref">read_gbq</span></a></p></td>
<td><p><a class="reference internal" href="#io-bigquery"><span class="std std-ref">to_gbq</span></a></p></td>
</tr>
</tbody>
</table>

### Carga de archivos

Veamos un ejemplo de carga de datos mediante el método `read_csv`.

In [1]:
import matplotlib.pyplot as plt
import pandas as pd
import numpy as np

In [2]:
df = pd.read_csv("https://raw.githubusercontent.com/ssanchezgoe/curso_deep_learning_economia/main/data/titanic-train.csv")

Inspección de la cabecera mediante el método `head()`

In [3]:
df.head()

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S
4            5         0       3  ...   8.0500   NaN         S

[5 rows x 12 columns]

El tipo de la variable almacenada en `df` es `DataFrame` de `pandas`:

In [4]:
type(df)

pandas.core.frame.DataFrame

### Información de las variables almacenadas:

Obtengamos un resumen de todas las características almacenadas en el dataframe mediante el método `info()`:

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

### Resumen estadístico

Realicemos un resumen estadístico de las variables numéricas:

In [6]:
df.describe()

       PassengerId    Survived      Pclass  ...       SibSp       Parch        Fare
count   891.000000  891.000000  891.000000  ...  891.000000  891.000000  891.000000
mean    446.000000    0.383838    2.308642  ...    0.523008    0.381594   32.204208
std     257.353842    0.486592    0.836071  ...    1.102743    0.806057   49.693429
min       1.000000    0.000000    1.000000  ...    0.000000    0.000000    0.000000
25%     223.500000    0.000000    2.000000  ...    0.000000    0.000000    7.910400
50%     446.000000    0.000000    3.000000  ...    0.000000    0.000000   14.454200
75%     668.500000    1.000000    3.000000  ...    1.000000    0.000000   31.000000
max     891.000000    1.000000    3.000000  ...    8.000000    6.000000  512.329200

[8 rows x 7 columns]

Incluyamos ahora todas las variables:

In [7]:
df.describe(include='all')

        PassengerId    Survived      Pclass  ...        Fare Cabin  Embarked
count    891.000000  891.000000  891.000000  ...  891.000000   204       889
unique          NaN         NaN         NaN  ...         NaN   147         3
top             NaN         NaN         NaN  ...         NaN    G6         S
freq            NaN         NaN         NaN  ...         NaN     4       644
mean     446.000000    0.383838    2.308642  ...   32.204208   NaN       NaN
std      257.353842    0.486592    0.836071  ...   49.693429   NaN       NaN
min        1.000000    0.000000    1.000000  ...    0.000000   NaN       NaN
25%      223.500000    0.000000    2.000000  ...    7.910400   NaN       NaN
50%      446.000000    0.000000    3.000000  ...   14.454200   NaN       NaN
75%      668.500000    1.000000    3.000000  ...   31.000000   NaN       NaN
max      891.000000    1.000000    3.000000  ...  512.329200   NaN       NaN

[11 rows x 12 columns]

### Métodos de indexado
Los tipos de indexados para localización de registros son los siguientes:
- Localización basada en enteros (iloc) de registros.
- Localización basada en etiquetas (loc) de registros.

In [8]:
print(df.iloc[4])
print(40*'-')
print(type(df.iloc[4]))

PassengerId                           5
Survived                              0
Pclass                                3
Name           Allen, Mr. William Henry
Sex                                male
Age                                  35
SibSp                                 0
Parch                                 0
Ticket                           373450
Fare                               8.05
Cabin                               NaN
Embarked                              S
Name: 4, dtype: object
----------------------------------------
<class 'pandas.core.series.Series'>

In [9]:
print(df.loc[0:4,"Ticket"])
print(40*'-')
print(type(df.loc[0:4,"Ticket"]))

0           A/5 21171
1            PC 17599
2    STON/O2. 3101282
3              113803
4              373450
Name: Ticket, dtype: object
----------------------------------------
<class 'pandas.core.series.Series'>

### Series y Subdataframes

Las series corresponde a una columna de un dataframe que hereda ciertos métodos del datagrame.

Una forma de acceder a una serie es 

```
df['Nombre_Columna']
```

También se puede obtener una serie mediante la siguiente sintáxis
```
df.Nombre_Columna
```

siempre que `Nombre_Columna` cumpla con buenas práxis de escritura: No debe contener espacios, caracteres especiales, etc.

Una vez se obtiene la serie, ésta hereda varios métodos de un dataframe, entre ellos el método `head`, con el que se puede realizar la operación de la celda anterior de la siguiente forma

In [10]:
df['Ticket'].head()

0           A/5 21171
1            PC 17599
2    STON/O2. 3101282
3              113803
4              373450
Name: Ticket, dtype: object

Si queremos acceder a un dataframe, debemos usar la siguiente sintáxis

```
df[[Lista Columnas separada por coma]]
```

y, apartir del dataframe, aplicamos el método que se desee:

In [12]:
df[['Embarked', 'Ticket']].head()

  Embarked            Ticket
0        S         A/5 21171
1        C          PC 17599
2        S  STON/O2. 3101282
3        S            113803
4        S            373450

### Selecciones 

Para seleccionar partes de un `DataFrame` que cumplan cierto criterio, debemos crear primero una **máscara** compuesta por booleanos que filtra los datos en el dataset dependiendo si la condición es *falsa* (no se visualiza el dato) o *verdadera* (se visualiza el dato que la cumple). La sintáxis para filtrar los datos en un dataframe es:

```
df[cond]
```
en donde la `cond` tiene la forma de un condicional evaluado en el dataframe, por ejemplo

```
cond -> df > 10
```

Veamos en el dataframe del titanic, la población mayor a 70 años.

In [23]:
# Creación de máscara
print("Máscara\n", df['Age']>70)
print(65*'-')
print("Cantidad de datos que cumplen la condición:", pd.DataFrame(df['Age']>70).Age.sum())
print(65*'-')
print(df[df['Age']>70])

Máscara
 0      False
1      False
2      False
3      False
4      False
       ...
886    False
887    False
888    False
889    False
890    False
Name: Age, Length: 891, dtype: bool
-----------------------------------------------------------------
Cantidad de datos que cumplen la condición: 5
-----------------------------------------------------------------
     PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
96            97         0       1  ...  34.6542    A5         C
116          117         0       3  ...   7.7500   NaN         Q
493          494         0       1  ...  49.5042   NaN         C
630          631         1       1  ...  30.0000   A23         S
851          852         0       3  ...   7.7750   NaN         S

[5 rows x 12 columns]

Otra forma de obtener los datos filtrdos es mediante el método `query()`, el cual puede especificarse de la siguiente forma

```
df_filtered = df.query("condición")
```
en donde la `"condición"` representa un string con la condición a evaluar. El objeto obtenido `df_filtered` mediante el método `query`, corresponde a `DataFrame`.

Filtremos aquellas personas mayores a 70 años en el dataset del titanic.

In [25]:
df.query("Age > 70")

     PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
96            97         0       1  ...  34.6542    A5         C
116          117         0       3  ...   7.7500   NaN         Q
493          494         0       1  ...  49.5042   NaN         C
630          631         1       1  ...  30.0000   A23         S
851          852         0       3  ...   7.7750   NaN         S

[5 rows x 12 columns]

### Selecciones con multiples condicionales

Para concatenar multiples condiciones debemos realizarlo determinando cada condicione entre paréntesis, seguida de los operardores lógicos  `&,|`. La sintáxis general para condiciones conectadas por el operador `&` es la siguiente

```
df[(cond)&(cond)]
```

Obtengamos, por ejemplo, la población mayor a 40 años con 2 hijos:

In [29]:
df[(df.Age>40)&(df.SibSp==2)]

     PassengerId  Survived  Pclass  ...      Fare Cabin  Embarked
245          246         0       1  ...   90.0000   C78         Q
571          572         1       1  ...   51.4792  C101         S
660          661         1       1  ...  133.6500   NaN         S
860          861         0       3  ...   14.1083   NaN         S

[4 rows x 12 columns]

Extraigamos la población que sea mayor a 70 o tenga 5 hijos:

In [32]:
df[(df.Age>70)|(df.SibSp==5)]

     PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
59            60         0       3  ...  46.9000   NaN         S
71            72         0       3  ...  46.9000   NaN         S
96            97         0       1  ...  34.6542    A5         C
116          117         0       3  ...   7.7500   NaN         Q
386          387         0       3  ...  46.9000   NaN         S
480          481         0       3  ...  46.9000   NaN         S
493          494         0       1  ...  49.5042   NaN         C
630          631         1       1  ...  30.0000   A23         S
683          684         0       3  ...  46.9000   NaN         S
851          852         0       3  ...   7.7750   NaN         S

[10 rows x 12 columns]

Cualquiera de los dos filtros aplicados en las celdas anteriores, pueden realizarse mediante el método `query()`de un dataframe:

In [38]:
filtered_age = 40
filtered_SibSp = 2
df.query(f'(Age > {filtered_age})&(SibSp=={filtered_SibSp})')

     PassengerId  Survived  Pclass  ...      Fare Cabin  Embarked
245          246         0       1  ...   90.0000   C78         Q
571          572         1       1  ...   51.4792  C101         S
660          661         1       1  ...  133.6500   NaN         S
860          861         0       3  ...   14.1083   NaN         S

[4 rows x 12 columns]

### Valores únicos

Para obtener valores únicos en un dataframe, usamos el método `unique()`, de la siguiente forma:

```
df['Nombre_Columna'].unique
```
 
Este método aplica, tanto para variables categóricas como numéricas.

Obtengamos los valores únicos de ciertas variables categóricas.

**Nota:** Para ello usemos la función `select_dtypes` y especifiquemos en la selección el tipo de dato como `object`:

In [42]:
df.select_dtypes('object').columns

Index(['Name', 'Sex', 'Ticket', 'Cabin', 'Embarked'], dtype='object')

Tomemos las variables `Cabin` y `Embarked` para ver los valores únicos:

In [43]:
df.Cabin.unique()

array([nan, 'C85', 'C123', 'E46', 'G6', 'C103', 'D56', 'A6',
       'C23 C25 C27', 'B78', 'D33', 'B30', 'C52', 'B28', 'C83', 'F33',
       'F G73', 'E31', 'A5', 'D10 D12', 'D26', 'C110', 'B58 B60', 'E101',
       'F E69', 'D47', 'B86', 'F2', 'C2', 'E33', 'B19', 'A7', 'C49', 'F4',
       'A32', 'B4', 'B80', 'A31', 'D36', 'D15', 'C93', 'C78', 'D35',
       'C87', 'B77', 'E67', 'B94', 'C125', 'C99', 'C118', 'D7', 'A19',
       'B49', 'D', 'C22 C26', 'C106', 'C65', 'E36', 'C54',
       'B57 B59 B63 B66', 'C7', 'E34', 'C32', 'B18', 'C124', 'C91', 'E40',
       'T', 'C128', 'D37', 'B35', 'E50', 'C82', 'B96 B98', 'E10', 'E44',
       'A34', 'C104', 'C111', 'C92', 'E38', 'D21', 'E12', 'E63', 'A14',
       'B37', 'C30', 'D20', 'B79', 'E25', 'D46', 'B73', 'C95', 'B38',
       'B39', 'B22', 'C86', 'C70', 'A16', 'C101', 'C68', 'A10', 'E68',
       'B41', 'A20', 'D19', 'D50', 'D9', 'A23', 'B50', 'A26', 'D48',
       'E58', 'C126', 'B71', 'B51 B53 B55', 'D49', 'B5', 'B20', 'F G63',
       'C62 C64', 'E24', 'C90', 'C45', 'E8', 'B101', 'D45', 'C46', 'D30',
       'E121', 'D11', 'E77', 'F38', 'B3', 'D6', 'B82 B84', 'D17', 'A36',
       'B102', 'B69', 'E49', 'C47', 'D28', 'E17', 'A24', 'C50', 'B42',
       'C148'], dtype=object)

In [45]:
df.Embarked.unique()

array(['S', 'C', 'Q', nan], dtype=object)

#### Cuentas por clase.

Para realizar un conteo de clases (en donde las variables asociadas pueden ser categóricas o numéricas) por columna, usamos el método `value_counts`. Realicemos un conteo en dos tipos de variables: una numérica y otra categórica:

In [47]:
df.select_dtypes('object').columns

Index(['Name', 'Sex', 'Ticket', 'Cabin', 'Embarked'], dtype='object')

In [51]:
df.Sex.value_counts()

male      577
female    314
Name: Sex, dtype: int64

In [49]:
df.select_dtypes('number').columns

Index(['PassengerId', 'Survived', 'Pclass', 'Age', 'SibSp', 'Parch', 'Fare'], dtype='object')

In [52]:
df.Pclass.value_counts()

3    491
1    216
2    184
Name: Pclass, dtype: int64

### Organización de datos

Los datos pueden ser organizados en torno a una columna, de forma ascendente o descendente. Para esto, usamos la función `sort_values` de la forma

```
df.sort_values('Nombre_Columna', ascending=True/False)
```

en donde el parámetro `ascending` nos indica si los datos son ordenados de forma ascendente cuando el valor es `True`, o descendente, cuando el valor es `False`. 

Organicemos los datos del titanic, por edad, de forma ascendente y descendente:

In [54]:
df.sort_values('Age', ascending=True).head(15)

     PassengerId  Survived  Pclass  ...      Fare    Cabin  Embarked
803          804         1       3  ...    8.5167      NaN         C
755          756         1       2  ...   14.5000      NaN         S
644          645         1       3  ...   19.2583      NaN         C
469          470         1       3  ...   19.2583      NaN         C
78            79         1       2  ...   29.0000      NaN         S
831          832         1       2  ...   18.7500      NaN         S
305          306         1       1  ...  151.5500  C22 C26         S
827          828         1       2  ...   37.0042      NaN         C
381          382         1       3  ...   15.7417      NaN         C
164          165         0       3  ...   39.6875      NaN         S
183          184         1       2  ...   39.0000       F4         S
386          387         0       3  ...   46.9000      NaN         S
172          173         1       3  ...   11.1333      NaN         S
788          789         1       3  ...   20.5750      NaN         S
642          643         0       3  ...   27.9000      NaN         S

[15 rows x 12 columns]

In [55]:
df.sort_values('Age', ascending=False).head(15)

     PassengerId  Survived  Pclass  ...      Fare        Cabin  Embarked
630          631         1       1  ...   30.0000          A23         S
851          852         0       3  ...    7.7750          NaN         S
493          494         0       1  ...   49.5042          NaN         C
96            97         0       1  ...   34.6542           A5         C
116          117         0       3  ...    7.7500          NaN         Q
672          673         0       2  ...   10.5000          NaN         S
745          746         0       1  ...   71.0000          B22         S
33            34         0       2  ...   10.5000          NaN         S
54            55         0       1  ...   61.9792          B30         C
280          281         0       3  ...    7.7500          NaN         Q
456          457         0       1  ...   26.5500          E38         S
438          439         0       1  ...  263.0000  C23 C25 C27         S
545          546         0       1  ...   26.0000          NaN         S
275          276         1       1  ...   77.9583           D7         S
483          484         1       3  ...    9.5875          NaN         S

[15 rows x 12 columns]